app/controllers/admin/admins_controller.rb

SELECT  `admins`.* FROM `admins` ORDER BY `admins`.`updated_at` DESC LIMIT 10 OFFSET 0
---
  def index
    @Admins = Admin.order(updated_at: :desc).page params[:page]

INSERT INTO `admins` (`email`, `first_name`, `last_name`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('sadas@dsads.ru', 'ddfs', 'dds', '$2a$11$scHsfZY948A.FfT.w5E7jekWJRidTj4Csf3TI5X3r5tCJEhX88Wta', '2020-05-26 16:13:04', '2020-05-26 16:13:04')
---
  def create
    @Admin = Admin.new(admin_params)

    if @Admin.save

UPDATE `admins` SET `last_name` = 'Иванов1', `encrypted_password` = '$2a$11$IYMaoALqvhxsV0FrPiLObeEFS3fhBCyVcxr6Xkpjrs1c5pGnRHQPW', `updated_at` = '2020-05-28 07:07:15' WHERE `admins`.`id` = 4
---
  def update
    if @Admin.update(admin_params)

DELETE FROM `admins` WHERE `admins`.`id` = 2
---
  def destroy
    if @Admin.destroy

SELECT  `admins`.* FROM `admins` WHERE `admins`.`id` = 4 LIMIT 1
---
  def set_admin
    @Admin = Admin.find(params[:id])