app/controllers/admin/answers_controller.rb

INSERT INTO `answers` (`comment`, `ticket_id`, `created_at`, `updated_at`) VALUES ('dsa', 22, '2020-05-28 13:04:55', '2020-05-28 13:04:55')
---
  def create
    @Answers = @Ticket.answers.create(answers_params)

SELECT  `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 22 LIMIT 1
---
  def set_ticket
    @Ticket = Ticket.find(params[:ticket_id])