app/controllers/admin/operators_controller.rb

  def index
    @Operators = Operator.where("id > 0").page params[:page]
---
SELECT  `operators`.* FROM `operators` WHERE (id < 10000) LIMIT 10 OFFSET 0

  def create
    @Operator = Operator.new(operator_params)

    if@Operator.save
---
INSERT INTO `operators` (`email`, `first_name`, `last_name`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('dsf@das.ru', 'jsjl', 'jljjj', '$2a$11$u/IPdzMlPUOBd3wRazkYzO./7tT/d906Cb4m51sfb4mZiTJiIpiyC', '2020-06-04 13:21:01', '2020-06-04 13:21:01')

  def update
    if@Operator.update(operator_params)
---
UPDATE `operators` SET `encrypted_password` = '$2a$11$NSTA.GbwvWq5k1iWNi7K5u1t6Prng3oFrYaVJLkWa5aobNhrc58aS', `updated_at` = '2020-06-04 13:25:02' WHERE `operators`.`id` = 2

  def destroy
    if @Operator.destroy
---
DELETE FROM `operators` WHERE `operators`.`id` = 3

  def set_operator
    @Operator = Operator.find(params[:id])
---
SELECT  `operators`.* FROM `operators` WHERE `operators`.`id` = 1 LIMIT 1