app/controllers/admin/statuses_controller.rb

  def index
    @Statuses = Status.order(:id).page params[:page]
---
SELECT  `statuses`.* FROM `statuses` ORDER BY `statuses`.`id` ASC LIMIT 10 OFFSET 0

  def create
    @Status = Status.new(status_params)
    if @Status.save
---
INSERT INTO `statuses` (`name`, `created_at`, `updated_at`) VALUES ('das', '2020-06-04 10:55:23', '2020-06-04 10:55:23')

  def destroy
    if @Status.destroy
---
DELETE FROM `statuses` WHERE `statuses`.`id` = 4

  def set_status
    @Status = Status.find(params[:id])
---
SELECT  `statuses`.* FROM `statuses` WHERE `statuses`.`id` = 4 LIMIT 1