app/controllers/admin/status_controller.rb

  def index
    @Status = Status.order(:name).page params[:page]
---
SELECT  `statuses`.* FROM `statuses` ORDER BY `statuses`.`name` ASC LIMIT 10 OFFSET 0