app/controllers/admin/tickets_controller.rb

SELECT  `tickets`.* FROM `tickets` ORDER BY `tickets`.`updated_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `tickets`
---
  def index
    @Tickets = Ticket.order(updated_at: :desc).page params[:page]

INSERT INTO `tickets` (`title`, `email`, `body`, `created_at`, `updated_at`) VALUES ('13', '12', 'йй', '2020-05-25 14:43:51', '2020-05-25 14:43:51')
---
  def create
    if Ticket.where(ticket_params)
      @Ticket = Ticket.new(ticket_params)
      @Ticket[:uuid] = SecureRandom.hex(10)
      if@Ticket.save

UPDATE `tickets` SET `body` = '<p>dasasdadsasd<img src=\"../../../uploads/tinymce_image/file/2/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA_%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0_2020-06-01_%D0%B2_17.12.54.png\" alt=\"\" width=\"500\" height=\"400\" /></p>', `updated_at` = '2020-06-02 09:56:53' WHERE `tickets`.`id` = 42
---
  def update
    if@Ticket.update!(ticket_params)

DELETE FROM `tickets` WHERE `tickets`.`id` = 29
---
  def destroy
    if @Ticket.destroy

SELECT  `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 47 LIMIT 1
---
  def set_ticket
    @Ticket = Ticket.find(params[:id])