app/controllers/admin/tinymce_images_controller.rb

  def create
   image = TinymceImage.new(tinymce_image_params)
   image.owner = owner

   if image.save
---
INSERT INTO `tinymce_images` (`file`, `owner_type`, `owner_id`, `created_at`, `updated_at`) VALUES ('dsa.png', 'Ticket', 22, '2020-06-01 14:53:33', '2020-06-01 14:53:33')