app/controllers/admin/types_controller.rb

SELECT  `types`.* FROM `types` ORDER BY `types`.`name` ASC LIMIT 10 OFFSET 0
---
  def index
    @Types = Type.order(:name).page params[:page]

INSERT INTO `types` (`name`, `created_at`, `updated_at`) VALUES ('Инфо', '2020-05-26 10:58:18', '2020-05-26 10:58:18')
---
  def create
    @Type = Type.new(type_params)
    if @Type.save

UPDATE `types` SET `name` = 'Информация', `updated_at` = '2020-05-26 10:58:28' WHERE `types`.`id` = 4
---
  def update
    if@Type.update(type_params)

DELETE FROM `types` WHERE `types`.`id` = 5
---
  def destroy
    if @Type.destroy

SELECT  `types`.* FROM `types` WHERE `types`.`id` = 2 LIMIT 1
---
  def set_type
    @Type = Type.find(params[:id])