app/views/admin/operators/index.html.slim

SELECT  `operators`.* FROM `operators` ORDER BY `operators`.`updated_at` DESC LIMIT 10 OFFSET 0
---
      th scope="col"  #
      th scope="col"= I18n.t('operator.first_name')