app/controllers/operator/tickets_controller.rb

  def index
    @Tickets = Ticket.where("operator_id = 0 or operator_id is null").order(updated_at: :desc).page params[:page]
---
SELECT  `tickets`.* FROM `tickets` WHERE (operator_id = 0 or operator_id is null) ORDER BY `tickets`.`updated_at` DESC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `tickets` WHERE (operator_id = 0 or operator_id is null)

  def indexthis
    @Tickets = Ticket.where("operator_id = :me", {me: current_operator.id}).order(updated_at: :desc).page params[:page]
---
SELECT  `tickets`.* FROM `tickets` WHERE (operator_id = me) ORDER BY `tickets`.`updated_at` DESC LIMIT 10 OFFSET 0

  def set_ticket
    @Ticket = Ticket.find(params[:id])
---
SELECT  `tickets`.* FROM `tickets` WHERE `tickets`.`id` = 46 LIMIT 1