app/views/admin/tickets/_form.html.slim

SELECT `types`.* FROM `types` ORDER BY `types`.`id` DESC
SELECT `statuses`.* FROM `statuses`
SELECT `operators`.* FROM `operators`
---
  = f.input :email
  = f.association :type, collection: Type.all.decorate, label_method: :type_number, label: I18n.t('ticket.type')
  = f.association :status, collection: Status.all, label_method: :name, label: I18n.t('status.status')
  = f.association :operator, collection: Operator.all.decorate, label_method: :full_name, label: I18n.t('operator.operator')